app/controllers/transactions_controller.rb

INSERT INTO "transactions" ("amount", "reference", "created_at", "updated_at", "sender_id", "receiver_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["amount", 50.0], ["reference", "okok"], ["created_at", "2020-08-01 13:50:13.244725"], ["updated_at", "2020-08-01 13:50:13.244725"], ["sender_id", 10], ["receiver_id", 10]]
---
  def create
    transaction = Transaction.new(parse_params_to_transaction(transaction_params))
    if transaction.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def parse_params_to_transaction(transaction_params)
    byebug
    {
      sender: User.find(transaction_params[:senderId].to_i),
      receiver: transaction_params[:senderId].to_i,
      reference: transaction_params[:reference],
      amount: transaction_params[:amount]