app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    render json: UserSerializer.new(User.all)