app/models/transaction.rb

INSERT INTO "transactions" ("amount", "reference", "created_at", "updated_at", "sender_id", "receiver_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["amount", 100.0], ["reference", "Signup Bonus"], ["created_at", "2020-07-31 15:32:41.006121"], ["updated_at", "2020-07-31 15:32:41.006121"], ["sender_id", 12], ["receiver_id", 12]]
INSERT INTO "transactions" ("amount", "reference", "created_at", "updated_at", "sender_id", "receiver_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["amount", 100.0], ["reference", "Signup Bonus"], ["created_at", "2020-07-31 21:50:03.280242"], ["updated_at", "2020-07-31 21:50:03.280242"], ["sender_id", 25], ["receiver_id", 25]]
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "hello@bambank.com"], ["LIMIT", 1]]
---
  def self.create_bonus_transaction(new_user)
    Transaction.create(
      sender: User.find_by(email: "hello@bambank.com"),
      receiver: new_user,
      amount: 100,
      reference: "Signup Bonus"
    )