app/models/user.rb

  def adjust_balance(add_or_deduct, amount)
    case add_or_deduct
    when "add"
      self.update(balance: self.balance + amount)
    when "deduct"
      self.update(balance: self.balance - amount)
---
UPDATE "users" SET "updated_at" = $1, "balance" = $2 WHERE "users"."id" = $3  [["updated_at", "2020-07-31 21:52:48.503373"], ["balance", 1000100.0], ["id", 29]]
UPDATE "users" SET "balance" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["balance", 999900.0], ["updated_at", "2020-07-31 21:52:48.502038"], ["id", 29]]